/*
===========================================
Chapter 03
File: 04-select-users.sql
Description: Read data from users table
===========================================
*/

-- نمایش تمام اطلاعات
SELECT * FROM users;

------------------------------------------------

-- نمایش ستون‌های مشخص
SELECT
    first_name,
    last_name
FROM users;

------------------------------------------------

-- نمایش نام و ایمیل کاربران
SELECT
    first_name,
    email
FROM users;

------------------------------------------------

-- نمایش همه کاربران فعال
SELECT *
FROM users
WHERE is_active = TRUE;

------------------------------------------------

-- نمایش کاربر با شناسه 1
SELECT *
FROM users
WHERE id = 1;

------------------------------------------------

-- نمایش کاربر با ایمیل مشخص
SELECT *
FROM users
WHERE email = 'ali@example.com';

------------------------------------------------

-- مرتب‌سازی بر اساس نام
SELECT *
FROM users
ORDER BY first_name;

------------------------------------------------

-- مرتب‌سازی نزولی بر اساس شناسه
SELECT *
FROM users
ORDER BY id DESC;

------------------------------------------------

-- نمایش فقط دو کاربر اول
SELECT *
FROM users
LIMIT 2;

------------------------------------------------

-- رد کردن یک رکورد و نمایش دو رکورد بعدی
SELECT *
FROM users
OFFSET 1
LIMIT 2;