/*
===========================================
Aggregate Functions
===========================================
*/

-- تعداد کتاب‌ها
SELECT COUNT(*)
FROM books;

------------------------------------------------

-- مجموع قیمت کتاب‌ها
SELECT SUM(price)
FROM books;

------------------------------------------------

-- میانگین قیمت
SELECT AVG(price)
FROM books;

------------------------------------------------

-- بیشترین قیمت
SELECT MAX(price)
FROM books;

------------------------------------------------

-- کمترین قیمت
SELECT MIN(price)
FROM books;