/*
===========================================
Filtering Operators
===========================================
*/

------------------------------------------------
-- DISTINCT
------------------------------------------------

SELECT DISTINCT country
FROM authors;

------------------------------------------------
-- LIKE
------------------------------------------------

-- نام‌هایی که با J شروع می‌شوند

SELECT *
FROM authors
WHERE full_name LIKE 'J%';

------------------------------------------------

-- نام‌هایی که به y ختم می‌شوند

SELECT *
FROM authors
WHERE full_name LIKE '%y';

------------------------------------------------

-- نام‌هایی که داخلشان or وجود دارد

SELECT *
FROM authors
WHERE full_name LIKE '%or%';

------------------------------------------------
-- BETWEEN
------------------------------------------------

SELECT *
FROM books
WHERE price BETWEEN 20 AND 40;

------------------------------------------------

SELECT *
FROM books
WHERE stock BETWEEN 5 AND 20;

------------------------------------------------
-- IN
------------------------------------------------

SELECT *
FROM books
WHERE category_id IN (1,2);

------------------------------------------------

SELECT *
FROM authors
WHERE country IN (
    'Russia',
    'United Kingdom'
);

------------------------------------------------
-- NOT IN
------------------------------------------------

SELECT *
FROM authors
WHERE country NOT IN (
    'Russia'
);

------------------------------------------------
-- IS NULL
------------------------------------------------

SELECT *
FROM authors
WHERE birth_date IS NULL;

------------------------------------------------
-- IS NOT NULL
------------------------------------------------

SELECT *
FROM authors
WHERE birth_date IS NOT NULL;