/*
===========================================
GROUP BY & HAVING
===========================================
*/

------------------------------------------------
-- تعداد کتاب‌های هر دسته‌بندی
------------------------------------------------

SELECT
    category_id,
    COUNT(*) AS total_books
FROM books
GROUP BY category_id;

------------------------------------------------
-- میانگین قیمت کتاب‌های هر دسته‌بندی
------------------------------------------------

SELECT
    category_id,
    AVG(price) AS average_price
FROM books
GROUP BY category_id;

------------------------------------------------
-- مجموع موجودی هر دسته‌بندی
------------------------------------------------

SELECT
    category_id,
    SUM(stock) AS total_stock
FROM books
GROUP BY category_id;

------------------------------------------------
-- تعداد کتاب‌های هر نویسنده
------------------------------------------------

SELECT
    author_id,
    COUNT(*) AS total_books
FROM books
GROUP BY author_id;